Veterinaria/Veterinaria/app/controllers/admins_controller.rb

  def index
    @admins = Admin.all
---
SELECT "admins".* FROM "admins"

  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save
---
INSERT INTO "admins" ("nombre", "rut", "mail", "telefono", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nombre", "pepito"], ["rut", 12], ["mail", "adsasa"], ["telefono", 12], ["created_at", 2017-03-07 23:03:39 UTC], ["updated_at", 2017-03-07 23:03:39 UTC]]

  def destroy
    @admin.destroy
---
DELETE FROM "admins" WHERE "admins"."id" = $1  [["id", 1]]