Veterinaria/Veterinaria/app/controllers/agendas_controller.rb

SELECT "agendas".* FROM "agendas"
---
  def index
    @agendas = Agenda.all