Veterinaria/Veterinaria/app/controllers/productos_controller.rb

  def index
    @productos = Producto.all
---
SELECT "productos".* FROM "productos"