Veterinaria/Veterinaria/app/controllers/proveedors_controller.rb

  def index
    @proveedors = Proveedor.all
---
SELECT "proveedors".* FROM "proveedors"