Veterinaria/Veterinaria/app/controllers/veterinarios_controller.rb

SELECT "veterinarios".* FROM "veterinarios"
---
  def index
    @veterinarios = Veterinario.all